# PRATICA INDEPENDENTE Joins com Pandas.

### Considerando os datframes a seguir, criados a partir de dicionários, atenda aos exercícios.

In [1]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'absences': [3, 2, 5, 1]
                   }
                  )
#df1

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]
                   }
                  )
#df2

df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 
                    'supervisor': ['Carly', 'Guido', 'Steve']
                   }
                  )
#df3

#### Exercício 1: Usando a função `.merge()`, obter um dataframe como resultado da intersecão entre `df1` e `df2`.

In [6]:
work = pd.merge(df1,  df2)
display(work)

  employee        group  absences  hire_date
0      Bob   Accounting         3       2008
1     Jake  Engineering         2       2012
2     Lisa  Engineering         5       2004
3      Sue           HR         1       2014

#### Exercício 2: Calcule também a interseção entre o dataframe criado no exercício anterior e `df3`.

In [7]:
work_1 = pd.merge(work, df3)
display(work_1)

  employee        group  absences  hire_date supervisor
0      Bob   Accounting         3       2008      Carly
1     Jake  Engineering         2       2012      Guido
2     Lisa  Engineering         5       2004      Guido
3      Sue           HR         1       2014      Steve

#### Exercício 3: Usando o dataframe `df4` a seguir, gerar um novo dataframe que contenha o resultado dos três anteriores e `df4`.

In [9]:
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']
                   }
                  )
df4

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [17]:
work_2 = pd.merge(work_1, df4, left_on= 'employee', right_on='applier')
display(work_2)

,employee,group,absences,hire_date,supervisor,applier,position
0,Bob,Accounting,3,2008,Carly,Bob,CTO
1,Jake,Engineering,2,2012,Guido,Jake,Senior Developer
2,Lisa,Engineering,5,2004,Guido,Lisa,CFO
3,Sue,HR,1,2014,Steve,Sue,Head of HR

#### Exercício 4: Usar o método [`.drop()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) para eliminar as colunas redundantes.

In [20]:
work_2.drop(['applier'], axis=1)

  employee        group  absences  hire_date supervisor          position
0      Bob   Accounting         3       2008      Carly               CTO
1     Jake  Engineering         2       2012      Guido  Senior Developer
2     Lisa  Engineering         5       2004      Guido               CFO
3      Sue           HR         1       2014      Steve        Head of HR

#### Exercício 5: Agrupe o dataframe do exercício 4 e calcule a contagem de grupos `group` supervisionado por cada supervisor `supervisor`.

In [30]:
work_2.groupby(['group'])['supervisor'].value_counts()

group        supervisor
Accounting   Carly         1
Engineering  Guido         2
HR           Steve         1
Name: supervisor, dtype: int64

#### Exercício 6: Usando os DataFrames a seguir, realizar um `inner`, `outer`, `left` e `right` `join` entre eles. Antes de executar cada `join`, escrever um comentário com a saída esperada.

In [31]:
dfA = pd.DataFrame({"a":[1],
                    "b":[2],
                    "c":[3]
                   }
                  )
dfB = pd.DataFrame({"a":[1, 4],
                    "b":[7, 9],
                    "c":[8, 9]
                   }
                  )

In [56]:
print( 'Dados com outer', '\n')

df = pd.merge(dfA, 
              
         dfB, 
         on = 'a', 
         how = 'outer'
  
    )

df

Dados com outer

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9

In [57]:
print( 'Dados com inner', '\n')
df_inner = pd.merge(dfA, 
         dfB, 
         on = 'a', 
         how = 'inner'
        )
df_inner

Dados com inner

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [59]:
print('Dados com left', '\n')
df_left = pd.merge(dfA, 
         dfB, 
         on = 'a', 
         how = 'left'
        )
df_left

Dados com left

   a  b_x  c_x  b_y  c_y
0  1    2    3    7    8

In [60]:
print( 'Dados com outer', '\n')
df_right = pd.merge(dfA, 
         dfB, 
         on = 'a', 
         how = 'right'
        )
df_right

Dados com outer

   a  b_x  c_x  b_y  c_y
0  1  2.0  3.0    7    8
1  4  NaN  NaN    9    9